/******************************************************************************
* Copyright (c) 2026 lin
* SPDX-License-Identifier: MIT
******************************************************************************/

#include "buz.h"

/*************************************************
变量定义
*************************************************/
BUZ_TypeDef g_sBuz = {0};
BUZSET_TypeDef const t_u8BuzSet[] = 
														{
															{0, 0, 0},
															{50, 100, 3},
															{10, 10, 1},
															{50, 100, 30},
														};
																												
/******************************************************************
函数名称：						F_BuzInit
功能描述：						蜂鸣器初始化
调用本函数的时钟周期：无		
输入参数：						无
输出参数：						无
其他说明：						无
*******************************************************************/
void F_BuzInit(void)
{
	//GPIO初始化配置
}
/******************************************************************
函数名称：						F_BuzSet
功能描述：						蜂鸣器设置
调用本函数的时钟周期：无
输入参数：						参数1:蜂鸣器响时间 参数2:蜂鸣器响周期 参数3:蜂鸣器响次数
输出参数：						无
其他说明：						无
*******************************************************************/
void F_BuzSet(BUZ_TypeDef *l_sBuz,BUZSET_TypeDef const *l_sBuzSet)
{	
	l_sBuz->g_u8Add = 0;
	l_sBuz->g_psBuzSet = l_sBuzSet;
}
/******************************************************************
函数名称：						F_BuzCnt
功能描述：						蜂鸣器计时
调用本函数的时钟周期：10ms
输入参数：						无
输出参数：						无
其他说明：						无
*******************************************************************/
void F_BuzCnt(BUZ_TypeDef *l_sBuz)
{
	if(l_sBuz->g_psBuzSet->g_u8Num > 0){
		
		if(l_sBuz->g_u8Add < l_sBuz->g_psBuzSet->g_u8Duty){
			l_sBuz->g_u8Out = 1;
		}else{
			l_sBuz->g_u8Out = 0;
		}
		
		if(++l_sBuz->g_u8Add >= l_sBuz->g_psBuzSet->g_u8Period){
			l_sBuz->g_u8Add = 0;
			l_sBuz->g_psBuzSet->g_u8Num--;
		}
	}else{
		l_sBuz->g_u8Add = 0;
		l_sBuz->g_u8Out = 0;
	}
}
/******************************************************************
函数名称：						F_BuzOut
功能描述：						4K蜂鸣器输出
调用本函数的时钟周期：125us
输入参数：						无
输出参数：						无
其他说明：						无
*******************************************************************/
void F_BuzOut(BUZ_TypeDef *l_sBuz)
{ 
	if(l_sBuz->g_u8Out > 0){
		def_BuzPin = ~def_BuzPin;
	}else{	
		def_BuzPin = 0;
	}
}